Функция СформироватьОтчет(ДатаОтчета) Экспорт
    
    Запрос = Новый Запрос;
    
    Запрос.Текст = 
        "ВЫБРАТЬ
        |    Товары.Ссылка КАК Товар,
        |    Товары.Наименование КАК НаименованиеТовара,
        |    ЕСТЬNULL(Остатки.КоличествоОстаток, 0) КАК Количество
        |ИЗ
        |    Справочник.Товары КАК Товары
        |        ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
        |            &ДатаОтчета
        |        ) КАК Остатки
        |        ПО Товары.Ссылка = Остатки.Товар
        |ГДЕ
        |    Товары.ЭтоГруппа = ЛОЖЬ
        |
        |УПОРЯДОЧИТЬ ПО
        |    НаименованиеТовара";
    
    Запрос.УстановитьПараметр("ДатаОтчета", ДатаОтчета);
    
    Возврат Запрос.Выполнить();
    
КонецФункции